In [2]:
import pandas as pd

#### Consider the below code to answer further questions:

In [3]:
course_name = ["Data Science","Machine Learning", "Big Data", "Data Engineer"]
duration = [2,3,6,4]
df = pd.DataFrame(data = {"course_name": course_name, "duration": duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

### Q1. Write a code to print the data present in the second row of the dataframe, df.

In [4]:
df[1:2]

        course_name  duration
1  Machine Learning         3

### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

In [5]:
df.loc[1,"course_name"]

'Machine Learning'

In [6]:
df.iloc[2,1]

6

- From above examples we can see that in .loc function we can type the name of the row and column.
- While in .iloc function we can write indexes of the row and column.
- .loc stands for location and .iloc stands for integer-location.

### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2]
#### Did you observe any difference in both the outputs? If so then explain it.

In [7]:
reindex = [3,0,1,2]
new_df = df.reindex(reindex)

In [8]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [9]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [11]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

- The difference observed is nothing but how the .loc and .iloc functions work.
- In the .loc function we pass the arguments as row_name and column_name. Hence it searched for row named 2 and gave us the output.
- On the other hand, in the .iloc function we pass indexes as arguments for both row and column (row_index,col_index). Here we passed 2 so it returned us the row at 2nd index position which is Machine Learning.

#### Consider the below code to answer further questions:

In [12]:
import pandas as pd
import numpy as np
columns = ["column_1","column_2","column_3","column_4","column_5","column_6"]
indices = [1,2,3,4,5,6]
# Creating a dataframe
df1 = pd.DataFrame(np.random.rand(6,6),columns=columns, index = indices)

In [13]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.440531  0.074963  0.895350  0.144963  0.557147  0.485301
2  0.606637  0.786086  0.081736  0.077122  0.438798  0.608040
3  0.532626  0.262134  0.066950  0.366012  0.637914  0.370493
4  0.590007  0.307161  0.548174  0.195283  0.185383  0.640635
5  0.208289  0.255738  0.092237  0.323377  0.259652  0.353053
6  0.625482  0.874174  0.389376  0.596378  0.519245  0.932008

### Q4. Write a code to find the following statistical measurements for the above dataframe df1:
#### (i) 	mean of each and every column present in the dataframe.
#### (ii) standard deviation of column, ‘column_2’

In [14]:
df1.mean()

column_1    0.500595
column_2    0.426709
column_3    0.345637
column_4    0.283856
column_5    0.433023
column_6    0.564922
dtype: float64

In [15]:
df1['column_2'].std()

0.3236387876885782

### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2. If you are getting errors in executing it then explain why.
#### [Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [16]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.440531  0.074963  0.895350  0.144963  0.557147  0.485301
2  0.606637  0.786086  0.081736  0.077122  0.438798  0.608040
3  0.532626  0.262134  0.066950  0.366012  0.637914  0.370493
4  0.590007  0.307161  0.548174  0.195283  0.185383  0.640635
5  0.208289  0.255738  0.092237  0.323377  0.259652  0.353053
6  0.625482  0.874174  0.389376  0.596378  0.519245  0.932008

In [19]:
df1.loc[2,"column_2"] = "rat"

In [20]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.440531  0.074963  0.895350  0.144963  0.557147  0.485301
2  0.606637       rat  0.081736  0.077122  0.438798  0.608040
3  0.532626  0.262134  0.066950  0.366012  0.637914  0.370493
4  0.590007  0.307161  0.548174  0.195283  0.185383  0.640635
5  0.208289  0.255738  0.092237  0.323377  0.259652  0.353053
6  0.625482  0.874174  0.389376  0.596378  0.519245  0.932008

In [21]:
df1['column_2'].mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

We are getting an error because a string and a number can't be added or perform any arithmetic operation.

### Q6. What do you understand about the windows function in pandas and list the types of windows functions?

- The windows (rolling) function is very useful in rolling calculations.
- Such as moving averages, etc.
- In rolling function we pass window size as an argument.
- Here is a list of functions we can use with windowing:
    - sum()
    - mean()
    - var()
    - std()
    - min()
    - max()
    - median()
    - mode()

### Q7. Write a code to print only the current month and year at the time of answering this question.
#### [Hint: Use pandas.datetime function]

In [39]:
current_timestamp = pd.Timestamp(year=2023,month=9,day=3).now()

In [40]:
print(current_timestamp.month, current_timestamp.year)

9 2023

### Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. The program should prompt the user to enter the dates and display the result.

In [44]:
print("Find the difference between two dates. Enter the dates in YYYY-MM-DD format below.")
date1 = input("Date 1: ")
date2 = input("Date 2: ")

d1 = pd.to_datetime(date1)
d2 = pd.to_datetime(date2)

print(d1-d2)

Find the difference between two dates. Enter the dates in YYYY-MM-DD format below.
Date 1: 2023-09-03
Date 2: 2023-09-01
2 days 00:00:00

### Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified column to a categorical data type. The program should prompt the user to enter the file path, column name, and category order, and then display the sorted data.

In [64]:
data_file = input("Enter csv file link: ")
df = pd.read_csv(data_file)
print(df.columns)
col_name = input("Enter column name: ")

if col_name not in df.columns:
    print("Column not found. Try running the program again")

cat_order_str = input("Enter category order (separated by space): ").split(" ")
cat_order = []
for i in cat_order_str:
    cat_order.append(int(i))

df[col_name] = pd.Categorical(df[col_name], categories=cat_order, ordered=True)
df.sort_values(by=col_name, inplace=True)

df

Enter csv file link: https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Enter column name: Pclass
Enter category order (separated by space): 1 2 3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S
310,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.0,0,0,11767,83.1583,C54,C
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
306,307,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
379,380,0,3,"Gustafsson, Mr. Karl Gideon",male,19.0,0,0,347069,7.7750,NaN,S
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.0,0,2,2653,15.7417,NaN,C
382,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
371,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and displays the results in a table. 
The program should do the following: <br>
Prompt the user to enter the file path of the CSV file containing the student data. <br>
Read the CSV file into a Pandas DataFrame. <br>
Calculate the mean, median, and mode of the test scores using Pandas tools. <br>
Display the mean, median, and mode in a table. <br>

In [88]:
file_path = input("Enter file path: ")
df = pd.read_csv(file_path)

mean = df['TestScore'].mean()
median = df['TestScore'].median()
mode = df['TestScore'].mode()

data = {
    "Statistics": ["Mean","Median","Mode"],
    "Value": [mean,median,mode[0]]
}

new_df = pd.DataFrame(data)
new_df

Enter file path: C:/Ratan/ds lab/from pandas/student_data.csv

  Statistics  Value
0       Mean   83.5
1     Median   85.0
2       Mode   85.0